{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/feed.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/TD-4KP-configuration",
            "content_html": "\nYou might not now that you can export and import your exadrums configuration.\nThis is a simple feature, but it can be very useful to create backups of your drum kits, or share them.\nThe first eXaDrums triggers input board has been designed for the Roland TD-4KP.\nWouldn't be nice to save all the triggers settings, instruments sounds, etc. for this drum kit, so that anyone can play with the TD-4KP?\nHere's why I'm sharing the configuration I've been using for my tests on that drum kit: [https://github.com/SpintroniK/exadrums-data/tree/TD-4KP](https://github.com/SpintroniK/exadrums-data/tree/TD-4KP).\n\n<!--more-->\n\nIf you click on the link, you'll notice that there's a little Readme file to help you install the kit.\nIt's a very simple and quick operation.\n\nWith any luck, reading this post will make you want to export some of your kits.\nI think this is one of the steps that will add a social dimension to exadrums, so be prepared to see more things going in that direction in the future!\n",
            "url": "https://news.exadrums.com/article/TD-4KP-configuration",
            "title": "TD-4KP Configuration",
            "summary": "You might not now that you can export and import your exadrums configuration.\nThis is a simple feature, but it can be very useful to create backups of your drum kits, or share them.\nThe first eXaDrums triggers input board has been designed for the Roland TD-4KP.\nWouldn't be nice to save all the triggers settings, instruments sounds, etc. for this drum kit, so that anyone can play with the TD-4KP?\nHere's why I'm sharing the configuration I've been using for my tests on that drum kit: https://github.com/SpintroniK/exadrums-data/tree/TD-4KP.",
            "date_modified": "2021-09-27T20:26:32.000Z",
            "date_published": "2021-09-27T20:26:32.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/debian-bullseye",
            "content_html": "\nToday, Debian 11 (Bullseye), has been officially released. This is a great news for *exadrums*, as this means it is now available in Debian. If you're using Debian (or Ubuntu, Raspberry Pi OS, and some [other distros](https://repology.org/project/exadrums/packages)), you can install exadrums via `apt`, i.e.:\n\n```bash\nsudo apt install exadrums\n```\n<!--more-->\n\n## What does this mean?\n\nWell, if you have about 5 MB to spare, you can install exadrums from the command line directly.\nHere's what you see from a fresh Debian Bullseye install:\n\n![image](/images/debian-bullseye/Screenshot_2021-08-15_11-14-02.png)\n\nNo more compiling, etc. `apt` handles everything for you!\n\n## What about Raspberry Pi OS?\n\nIt's only been a few hours since Debian 11 has been released, so there's no news about the next Raspberry Pi OS (formerly Raspbian). Let's give them some time to publish a proper release.\nI can already tell you that you'll get the same version of exadrums as Debian in Raspberry Pi OS, it'll be exadrums 0.6.0.\n\nAnyhow, when the new Raspberry Pi OS will be released, you'll be able to install exadrums via `apt` on your Raspberry Pi.\n\n## Using Debian Bullseye on a Raspberry Pi\n\nIf you don't want to wait until the version of Raspberry Pi OS comes out, you can install Debian Bullseye on your Raspberry Pi using one of the images available at: [ Tested images](https://raspi.debian.net/tested-images/). I haven't tried any of them, but they've been tested, so they should work.",
            "url": "https://news.exadrums.com/article/debian-bullseye",
            "title": "Debian 11 - Bullseye",
            "summary": "Today, Debian 11 (Bullseye), has been officially released. This is a great news for exadrums, as this means it is now available in Debian. If you're using Debian (or Ubuntu, Raspberry Pi OS, and some other distros), you can install exadrums via apt, i.e.:\nsudo apt install exadrums\n",
            "date_modified": "2021-08-21T16:17:58.000Z",
            "date_published": "2021-08-14T12:08:07.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/exadrums-dot-com",
            "content_html": "\nThe official exadrums website, [exadrums.com](https://exadrums.com), is online.\nIt shows that there's more than a just software to exadrums.\nEven though it is more a landing page than a website, it gives valuable information about the project.\nAnd frankly, I'm quite proud of the video!\n\n<div class=\"columns\">\n    <div class=\"column has-text-centered is-centered\">\n        <video controls=\"\" playsinline loop style=\"max-width: 40%;\" poster=\"/images/exadrums-dot-com/hero_img.jpg\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.mp4\" type=\"video/mp4\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.webm\" type=\"video/webm\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.ogv\" type=\"video/ogg\"> \n            Your browser does not support the video tag.\n        </video>\n    </div>\n</div>\n\n<!--more-->\n\nThe website's goal is also to explain how to build an exadrums module.\nBuilding the whole module (which is currently designed to work with the Roland TD4-KP), requires three main steps:\n\n- To install the software on a Raspberry Pi\n- To make the trigger input board.\n- To 3D-print the enclosure.\n\nJust so you know, you don't have to go through each step, as you can already play a fair bit with the software even on your PC or laptop.\n\nThere is also this _Make your Own_ button, which redirects to another web page that is currently under construction.\nThis page will be a custom user guide generator.\n\nThe idea is that everyone wants something different (or have a different drum set configuration), so it makes sense to have a custom user guide.\nI'll keep you informed about the progress I make on that page.\nIt should be available in a few weeks, or a few months.\nI'm not in a rush, as my goal is to make the best user guide possible.\n",
            "url": "https://news.exadrums.com/article/exadrums-dot-com",
            "title": "Exadrums.com",
            "summary": "The official exadrums website, exadrums.com, is online.\nIt shows that there's more than a just software to exadrums.\nEven though it is more a landing page than a website, it gives valuable information about the project.\nAnd frankly, I'm quite proud of the video!\n\n    \n        \n            \n            \n             \n            Your browser does not support the video tag.\n        \n    \n",
            "date_modified": "2021-09-01T17:04:20.000Z",
            "date_published": "2021-09-01T17:04:20.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "content_html": "\nOver the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\n\nMoreover, exadrums had to be a *modern* and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.\n\n<!--more-->\n\n## How to Make it Work as Expected?\n\nAbout three years ago, I wrote a short article that describes how and why I defined the software and hardware requirements, but also how I managed to make everything work as expected. I'll go into a bit more details below, but you can skip that part if you're in a hurry, and go straight to the article.\n\n## Making a Modern Drum Module\n\nMaking a modern drum module means breaking the rules. Nearly a hundred percent of the existing drum modules use a microcontroller to leverage their real-time properties. However, that means that the amount of memory is often limited, and the user interface is rudimentary (buttons, sliders, etc.), and can't evolve without modifying the hardware.\n\nBy choosing the Raspberry Pi, I made it possible to have a modern user interface, using a touchscreen, but I lost all the real-time goodness that microcontrollers have to offer.\nFortunately, there was a solution to reduce the latency with a Raspberry Pi.\nUnsurprisingly, getting more performance means going low-level, but also getting a good soundcard.\nThe soundcard latency represents a third of the total latency.\nThe software adds another third, and the last third is the trigger scan time.\n\n## Making a Trigger Input Board\n\nMaking a trigger input board, is not overly complicated. But there are still two big challenges:\n\n- Make sure all the components fit on the board.\n- Find a way to make the board compatible with all the drum pads out there.\n\nThe first challenge is not too hard, thanks to SMD components. Especially for a 8-input board. That'll be a bit more difficult with 16 inputs...\nAs for making the board compatible with all the drum pads, I decided to connect potentiometers to the piezos, so that their output voltage can be scaled down if necessary. That avoids the biggest problem: clipping!\n\n## How to Make a Modern Drum Module\n\nNow that you've got the context, maybe you'd like to read the article, so here it is.\nIf for some reason your web browser doesn't show the pdf, here's a link to it: <a href=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" target=\"_blank\">How to Make a Modern Drum Module</a>.\n<object data=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" type=\"application/pdf\" style=\"width: 100%; height: 100vh\"></object>\n",
            "url": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "title": "How to Make a Modern Drum Module",
            "summary": "Over the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\nMoreover, exadrums had to be a modern and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.",
            "date_modified": "2021-10-02T06:27:36.000Z",
            "date_published": "2021-10-02T06:27:36.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/libexadrums-js",
            "content_html": "\nAchieving low latency and performance for exadrums was possible thanks to the C++ programming language.\nC++ is a great language because it offers both low- and high-level programming styles, but I find it a bit limited when it comes to user interfaces.\nOn the other hand, javascript isn't the best language for performance, but or user interfaces it really shines, thanks to its integration with html and css.\n\nBut can we get a nice and responsive html + css + js user interface, and get the C++ performance?\nThat's what [libexadrums.js](https://github.com/SpintroniK/libexadrums.js) does.\nIt is basically javascript a wrapper of the exadrums C++ library (libexadrums).\nUsing the Node-API interface, (lib)exadrums can be used in any nodejs project, with almost no performance loss.\nIt is a node package that [brings libexadrums to the nodejs world](https://news.exadrums.com/article/the-future-of-exadrums), and you can find it here: https://www.npmjs.com/package/@exadrums/libexadrums.js.\n\n<!--more-->\n\n## How it works\n\nThe way libexadrums.js works is very simple, it is just a javascript wrapper around the original C++ library.\nEvery function call is translated from javascript to a C++ function call.\n\nSo when you start your drum module, a javascript function calls the C++ start function, which in turns starts the module.\nBut the cool thing is, once the module has started, it runs the native compiled C++ program, so there's no performance hit whatsoever.\nThat way, you do get the best of both worlds.\n\n## What's next?\n\nSo far, libexadrums.js is not complete, some functions are missing, and it will take some time to add them.\nBut the main goal is to make a better user interface.\nThe plan is to develop an [electron](https://www.electronjs.org/) application, that will become an alternative to the native C++ interface.\nI don't think it will replace it, but it'll be used by people who want a more connected experience.\n\nImagine a user interface than leverages CSS transitions, animations, together with [vuejs](https://vuejs.org/), and javascript's fetch api. I think that can make the development easier, and faster. And hopefully drummers that use exadrums will highly benefit from that!\n",
            "url": "https://news.exadrums.com/article/libexadrums-js",
            "title": "libexadrums.js",
            "summary": "Achieving low latency and performance for exadrums was possible thanks to the C++ programming language.\nC++ is a great language because it offers both low- and high-level programming styles, but I find it a bit limited when it comes to user interfaces.\nOn the other hand, javascript isn't the best language for performance, but or user interfaces it really shines, thanks to its integration with html and css.\nBut can we get a nice and responsive html + css + js user interface, and get the C++ performance?\nThat's what libexadrums.js does.\nIt is basically javascript a wrapper of the exadrums C++ library (libexadrums).\nUsing the Node-API interface, (lib)exadrums can be used in any nodejs project, with almost no performance loss.\nIt is a node package that brings libexadrums to the nodejs world, and you can find it here: https://www.npmjs.com/package/@exadrums/libexadrums.js.",
            "date_modified": "2021-10-16T13:26:21.000Z",
            "date_published": "2021-10-16T13:26:21.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "content_html": "\nRemember this article about [exadrums becoming an official Debian package](article/debian-bullseye)?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS *bullseye* a few days ago, and as you may have guessed, it includes exadrums packages:\n\n![image](/images/raspberry-pi-os-bullseye/screenshot.png)\n\nNow, you simply have to type `sudo apt install exadrums` into a terminal to install exadrums on your Raspberry Pi.\n\n<!--more-->\n\nIt took some time to get to that point, but you get exadrums 0.6.0, which fairly recent, and works on my Roland TD-4KP drum set.\nIf you'd like to try exadrums with your TD-4KP drum set, it's quite easy.\nFirst of all, you'll need to install *zip*, as it's not installed by default: `sudo apt install zip`.\nThen, you can go to the following page: https://github.com/SpintroniK/exadrums-data/tree/TD-4KP and follow the instructions.\n\nObviously, the project is still under development and future versions will support more inputs, and have a lot of improvements.\nThe official documentation is far from being complete, but I'll make sure to add guidelines to help install the latest version of exadrums on a Raspberry Pi. I will make sure the future versions work on the current version of Raspberry Pi OS *bullseye*. Stay tuned, new versions are coming!\n",
            "url": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "title": "Raspberry Pi OS - Bullseye",
            "summary": "Remember this article about exadrums becoming an official Debian package?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS bullseye a few days ago, and as you may have guessed, it includes exadrums packages:\n\nNow, you simply have to type sudo apt install exadrums into a terminal to install exadrums on your Raspberry Pi.",
            "date_modified": "2021-11-12T18:07:46.000Z",
            "date_published": "2021-11-12T18:07:46.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/the-future-of-exadrums",
            "content_html": "\nThe future of exadrums is probably different than what you may think.\n\nSo far, exadrums is a two-part software, there's a library, libexadrums, and another component: the user interface. The whole drum module is in the library, and exposes a C++ API. That means libexadrums can be used with other languages, such as Python, Javascript, etc.\n\n<!--more-->\n\nA C++ user interface has its advantages, but exadrums could benefit from other languages. For instance,  a more \"connected\" experience would be easier to implement in Python or Javascript.\n\nAnd that's how I see the future of exadrums: a Connected Open Source Drum Module. Some things are already in the works, but others will take some time. However, I'll do my best to publish news more frequently, to keep you informed about the project.\n\nAbout that, the project website [exadrums.com](https://exadrums.com) will be online pretty soon! Hope you'll like it.\n",
            "url": "https://news.exadrums.com/article/the-future-of-exadrums",
            "title": "The Future of exadrums",
            "summary": "The future of exadrums is probably different than what you may think.\nSo far, exadrums is a two-part software, there's a library, libexadrums, and another component: the user interface. The whole drum module is in the library, and exposes a C++ API. That means libexadrums can be used with other languages, such as Python, Javascript, etc.",
            "date_modified": "2021-08-25T14:48:20.000Z",
            "date_published": "2021-08-25T14:48:20.000Z"
        }
    ]
}