{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/feed.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/TD-4KP-configuration",
            "content_html": "\nYou might not now that you can export and import your exadrums configuration.\nThis is a simple feature, but it can be very useful to create backups of your drum kits, or share them.\nThe first eXaDrums triggers input board has been designed for the Roland TD-4KP.\nWouldn't be nice to save all the triggers settings, instruments sounds, etc. for this drum kit, so that anyone can play with the TD-4KP?\nHere's why I'm sharing the configuration I've been using for my tests on that drum kit: [https://github.com/SpintroniK/exadrums-data/tree/TD-4KP](https://github.com/SpintroniK/exadrums-data/tree/TD-4KP).\n\n<!--more-->\n\nIf you click on the link, you'll notice that there's a little Readme file to help you install the kit.\nIt's a very simple and quick operation.\n\nWith any luck, reading this post will make you want to export some of your kits.\nI think this is one of the steps that will add a social dimension to exadrums, so be prepared to see more things going in that direction in the future!\n",
            "url": "https://news.exadrums.com/article/TD-4KP-configuration",
            "title": "TD-4KP Configuration",
            "summary": "You might not now that you can export and import your exadrums configuration.\nThis is a simple feature, but it can be very useful to create backups of your drum kits, or share them.\nThe first eXaDrums triggers input board has been designed for the Roland TD-4KP.\nWouldn't be nice to save all the triggers settings, instruments sounds, etc. for this drum kit, so that anyone can play with the TD-4KP?\nHere's why I'm sharing the configuration I've been using for my tests on that drum kit: https://github.com/SpintroniK/exadrums-data/tree/TD-4KP.",
            "date_modified": "2021-09-27T20:26:32.000Z",
            "date_published": "2021-09-27T20:26:32.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/debian-bullseye",
            "content_html": "\nToday, Debian 11 (Bullseye), has been officially released. This is a great news for *exadrums*, as this means it is now available in Debian. If you're using Debian (or Ubuntu, Raspberry Pi OS, and some [other distros](https://repology.org/project/exadrums/packages)), you can install exadrums via `apt`, i.e.:\n\n```bash\nsudo apt install exadrums\n```\n<!--more-->\n\n## What does this mean?\n\nWell, if you have about 5 MB to spare, you can install exadrums from the command line directly.\nHere's what you see from a fresh Debian Bullseye install:\n\n![image](/images/debian-bullseye/Screenshot_2021-08-15_11-14-02.png)\n\nNo more compiling, etc. `apt` handles everything for you!\n\n## What about Raspberry Pi OS?\n\nIt's only been a few hours since Debian 11 has been released, so there's no news about the next Raspberry Pi OS (formerly Raspbian). Let's give them some time to publish a proper release.\nI can already tell you that you'll get the same version of exadrums as Debian in Raspberry Pi OS, it'll be exadrums 0.6.0.\n\nAnyhow, when the new Raspberry Pi OS will be released, you'll be able to install exadrums via `apt` on your Raspberry Pi.\n\n## Using Debian Bullseye on a Raspberry Pi\n\nIf you don't want to wait until the version of Raspberry Pi OS comes out, you can install Debian Bullseye on your Raspberry Pi using one of the images available at: [ Tested images](https://raspi.debian.net/tested-images/). I haven't tried any of them, but they've been tested, so they should work.",
            "url": "https://news.exadrums.com/article/debian-bullseye",
            "title": "Debian 11 - Bullseye",
            "summary": "Today, Debian 11 (Bullseye), has been officially released. This is a great news for exadrums, as this means it is now available in Debian. If you're using Debian (or Ubuntu, Raspberry Pi OS, and some other distros), you can install exadrums via apt, i.e.:\nsudo apt install exadrums\n",
            "date_modified": "2021-08-21T16:17:58.000Z",
            "date_published": "2021-08-14T12:08:07.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/exadrums-dot-com",
            "content_html": "\nThe official exadrums website, [exadrums.com](https://exadrums.com), is online.\nIt shows that there's more than a just software to exadrums.\nEven though it is more a landing page than a website, it gives valuable information about the project.\nAnd frankly, I'm quite proud of the video!\n\n<div class=\"columns\">\n    <div class=\"column has-text-centered is-centered\">\n        <video controls=\"\" playsinline loop style=\"max-width: 40%;\" poster=\"/images/exadrums-dot-com/hero_img.jpg\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.mp4\" type=\"video/mp4\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.webm\" type=\"video/webm\">\n            <source src=\"https://freewebmaster.fr/exadrums.com/assets/exadrums_hero_video.ogv\" type=\"video/ogg\"> \n            Your browser does not support the video tag.\n        </video>\n    </div>\n</div>\n\n<!--more-->\n\nThe website's goal is also to explain how to build an exadrums module.\nBuilding the whole module (which is currently designed to work with the Roland TD4-KP), requires three main steps:\n\n- To install the software on a Raspberry Pi\n- To make the trigger input board.\n- To 3D-print the enclosure.\n\nJust so you know, you don't have to go through each step, as you can already play a fair bit with the software even on your PC or laptop.\n\nThere is also this _Make your Own_ button, which redirects to another web page that is currently under construction.\nThis page will be a custom user guide generator.\n\nThe idea is that everyone wants something different (or have a different drum set configuration), so it makes sense to have a custom user guide.\nI'll keep you informed about the progress I make on that page.\nIt should be available in a few weeks, or a few months.\nI'm not in a rush, as my goal is to make the best user guide possible.\n",
            "url": "https://news.exadrums.com/article/exadrums-dot-com",
            "title": "Exadrums.com",
            "summary": "The official exadrums website, exadrums.com, is online.\nIt shows that there's more than a just software to exadrums.\nEven though it is more a landing page than a website, it gives valuable information about the project.\nAnd frankly, I'm quite proud of the video!\n\n    \n        \n            \n            \n             \n            Your browser does not support the video tag.\n        \n    \n",
            "date_modified": "2021-09-01T17:04:20.000Z",
            "date_published": "2021-09-01T17:04:20.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "content_html": "\nOver the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\n\nMoreover, exadrums had to be a *modern* and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.\n\n<!--more-->\n\n## How to Make it Work as Expected?\n\nAbout three years ago, I wrote a short article that describes how and why I defined the software and hardware requirements, but also how I managed to make everything work as expected. I'll go into a bit more details below, but you can skip that part if you're in a hurry, and go straight to the article.\n\n## Making a Modern Drum Module\n\nMaking a modern drum module means breaking the rules. Nearly a hundred percent of the existing drum modules use a microcontroller to leverage their real-time properties. However, that means that the amount of memory is often limited, and the user interface is rudimentary (buttons, sliders, etc.), and can't evolve without modifying the hardware.\n\nBy choosing the Raspberry Pi, I made it possible to have a modern user interface, using a touchscreen, but I lost all the real-time goodness that microcontrollers have to offer.\nFortunately, there was a solution to reduce the latency with a Raspberry Pi.\nUnsurprisingly, getting more performance means going low-level, but also getting a good soundcard.\nThe soundcard latency represents a third of the total latency.\nThe software adds another third, and the last third is the trigger scan time.\n\n## Making a Trigger Input Board\n\nMaking a trigger input board, is not overly complicated. But there are still two big challenges:\n\n- Make sure all the components fit on the board.\n- Find a way to make the board compatible with all the drum pads out there.\n\nThe first challenge is not too hard, thanks to SMD components. Especially for a 8-input board. That'll be a bit more difficult with 16 inputs...\nAs for making the board compatible with all the drum pads, I decided to connect potentiometers to the piezos, so that their output voltage can be scaled down if necessary. That avoids the biggest problem: clipping!\n\n## How to Make a Modern Drum Module\n\nNow that you've got the context, maybe you'd like to read the article, so here it is.\nIf for some reason your web browser doesn't show the pdf, here's a link to it: <a href=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" target=\"_blank\">How to Make a Modern Drum Module</a>.\n<object data=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" type=\"application/pdf\" style=\"width: 100%; height: 100vh\"></object>\n",
            "url": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "title": "How to Make a Modern Drum Module",
            "summary": "Over the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\nMoreover, exadrums had to be a modern and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.",
            "date_modified": "2021-10-02T06:27:36.000Z",
            "date_published": "2021-10-02T06:27:36.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/libexadrums-js",
            "content_html": "\nAchieving low latency and performance for exadrums was possible thanks to the C++ programming language.\nC++ is a great language because it offers both low- and high-level programming styles, but I find it a bit limited when it comes to user interfaces.\nOn the other hand, javascript isn't the best language for performance, but or user interfaces it really shines, thanks to its integration with html and css.\n\nBut can we get a nice and responsive html + css + js user interface, and get the C++ performance?\nThat's what [libexadrums.js](https://github.com/SpintroniK/libexadrums.js) does.\nIt is basically javascript a wrapper of the exadrums C++ library (libexadrums).\nUsing the Node-API interface, (lib)exadrums can be used in any nodejs project, with almost no performance loss.\nIt is a node package that [brings libexadrums to the nodejs world](https://news.exadrums.com/article/the-future-of-exadrums), and you can find it here: https://www.npmjs.com/package/@exadrums/libexadrums.js.\n\n<!--more-->\n\n## How it works\n\nThe way libexadrums.js works is very simple, it is just a javascript wrapper around the original C++ library.\nEvery function call is translated from javascript to a C++ function call.\n\nSo when you start your drum module, a javascript function calls the C++ start function, which in turns starts the module.\nBut the cool thing is, once the module has started, it runs the native compiled C++ program, so there's no performance hit whatsoever.\nThat way, you do get the best of both worlds.\n\n## What's next?\n\nSo far, libexadrums.js is not complete, some functions are missing, and it will take some time to add them.\nBut the main goal is to make a better user interface.\nThe plan is to develop an [electron](https://www.electronjs.org/) application, that will become an alternative to the native C++ interface.\nI don't think it will replace it, but it'll be used by people who want a more connected experience.\n\nImagine a user interface than leverages CSS transitions, animations, together with [vuejs](https://vuejs.org/), and javascript's fetch api. I think that can make the development easier, and faster. And hopefully drummers that use exadrums will highly benefit from that!\n",
            "url": "https://news.exadrums.com/article/libexadrums-js",
            "title": "libexadrums.js",
            "summary": "Achieving low latency and performance for exadrums was possible thanks to the C++ programming language.\nC++ is a great language because it offers both low- and high-level programming styles, but I find it a bit limited when it comes to user interfaces.\nOn the other hand, javascript isn't the best language for performance, but or user interfaces it really shines, thanks to its integration with html and css.\nBut can we get a nice and responsive html + css + js user interface, and get the C++ performance?\nThat's what libexadrums.js does.\nIt is basically javascript a wrapper of the exadrums C++ library (libexadrums).\nUsing the Node-API interface, (lib)exadrums can be used in any nodejs project, with almost no performance loss.\nIt is a node package that brings libexadrums to the nodejs world, and you can find it here: https://www.npmjs.com/package/@exadrums/libexadrums.js.",
            "date_modified": "2021-10-16T13:26:21.000Z",
            "date_published": "2021-10-16T13:26:21.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/new-arduino-nano-every-board-part1",
            "content_html": "\nThis project has been in the works for about a year.\nI often get questions about MIDI support, so I spent some time developing a new exadrums board that supports MIDI.\nBefore we start, please note that this post will be split into several parts.\n\nThe board is capable of handling 8 triggers.\nIt can send MIDI notes over USB, or directly to a serial device such as a Raspberry Pi.\nThere is no on-board Analog to Digital Converter (ADC). Instead, there are two 15-position Arduino Nano-compatible female headers.\nAny microcontroller that is pin-compatible with the Arduino Nano will fit.\nFor the rest of this post, I'll assume that the microcontroller is an Arduino Nano Every.\n\nBut before we dive into the details, check out that board!\n\n![image](/images/new-arduino-nano-every-board/board.png)\n![image](/images/new-arduino-nano-every-board/board-arduino.png)\n\nBoard alone (left), and board with Arduino mounted on (right).\nI went for a blue PCB so that it would match the Arduino's color.\n\n\n<!--more-->\n\n## Board Specs\n\nSo far, with an Arduino Nano Every, I've achieved the following:\n\n- Compatible with Roland TD-9, TD-11, TD-15, TD-17, TD-25, and TD-27-based edrum kits (DB25 connector).\n- Sample rate greater than 70ksps (kilo samples per second).\n- Nearly 9 samples per milliseconds and per channel (8.93 in average).\n- Configurable trigger parameters: threshold, scan time and mask time (1ms step).\n- Configurable MIDI channel and notes.\n\nUsing 7 of the 8 inputs (the pads only), I managed to optimize the firmware quite a bit, as it fits into less than 2k bytes of flash and uses less than 128 bytes of RAM. Of course, this will increase a little when the hi-hat pedal code will be added.\n\n## This New Board is Called TB08-SE\n\nThis new board's name is *eXaDrums TB08-SE*.\nRead *eXaDrums Trigger Board, 8 inputs, Special Edition*.\nI consider this board a special edition because this is the first exadrums board that is MIDI-compliant, and also because it is modular.\nAs you can see on the photos above, the Arduino isn't soldered to the board, which means you can use another microcontroller if you want to (for instance an STM32 Nucleo board). As long as the pinout is compabitle, of course. Note that I don't recommend the Arduino Nano for this board, as its ADC is way too slow. The Arduino Nano Every, on the other hand, is a perfect fit!\n\n## How it Works\n\n### Analog Circuitry\n\nThe analog part of the board is quite straightforward. It uses op-amps and passive components to scale down the piezo voltage to the 0-3.3V range.\nAt rest, the output voltage is 1.65V (3.3V/2).\nAmong the 8 inputs, 7 are intended to be used with single-zone pads, and one is to be used with a hi-hat controller.\n\nHere's how everything is wired:\n\n|  Instrument   | Cable Reference | Arduino Analog Input | ATMega4809 Analog Input |\n|---------------|-----------------|----------------------|-------------------------|\n| Kick          |  KIK            |  A0                  |  AIN3                   |\n| Snare         |  SNR            |  A1                  |  AIN2                   |\n| Hi-hat        |  HH             |  A2                  |  AIN1                   |\n| Hi-hat Control|  HHC            |  A3                  |  AIN0                   |\n| Crash         |  CR1            |  A4                  |  AIN12                  |\n| Tom1          |  T1             |  A5                  |  AIN13                  |\n| Tom3          |  T3             |  A6                  |  AIN4                   |\n| Ride          |  RD             |  A7                  |  AIN5                   |\n\n### Arduino Nano Every\n\nI chose the Arduino Nano Every because it's affordable, popular, small, and more importantly, because it has the right specs for the job!\nThe on-board ATMega4809 has plenty of flash and RAM, so I knew these wouldn't cause any issues.\nThe ADC is a crucial element for an edrum project, and the ATMega4809 has a 10-bit ADC that is capable of running at a 115ksps.\nFor a 8-input board, that means about 14 samples per millisecond and per channel, which is quite good (it's recommended to get, at the very least, 5 samples per ms and per channel. But usually, [it's best to get around 10 samples/ms/channel](https://www.vdrums.com/forum/advanced/technical/1215866-edrumin-let-s-talk-about-it?p=1216107#post1216107)).\n\nHowever, the ATMega4809 isn't a powerful beast. First of all, the Arduino Nano Every runs at 16MHz by default.\nAlthough you can change the CPU clock to a slightly higher frequency of 20MHz, I decided not to do that in order to keep things simple (and challenging).\nYou might think that 16MHz is quite a lot, after all it means that one clock cycle is as short as 62.5ns, but there's another catch.\nThe ATMega4809 is an 8-bit microcontroller, which means that even adding two 32-bit integers requires several clock cycles.\nSo, when you only have a few microseconds between each ADC reading, it's kind of foolish to consider floating point arithmetic...\nFIY, the Arduino Nano Every's score at the CoreMark CPU Benchmark is 8.20, where 32-bit microcontroller such as the Teensy 3.2 (72MHz) scores well above 100, and a Teensy 3.6 gets a core of 440, [which is more than 50 times the Arduino Nano Every score](https://github.com/PaulStoffregen/CoreMark).\n\nSo with all those limitations in mind, I decided to go for 12 microseconds between each sample.\nThat leaves around 200 instructions (per channel) for all the computations.\nUnfortunately, that was a bit ambitious, so I had to increase that time to 14µs, which leads to almost 9 samples per millisecond and per channel.\nBut you already knew that if you read the post from the beginning.\n\n## The Devil is in the Details\n\nSo what do we need to make this work?\nHere's a list I came up with when I was starting to think about this project.\nWe need to:\n\n- Get at least 5 samples per milliseconds and per channel.\n- Provide an internal time reference.\n- Avoid floating point numbers and complex calculations.\n- Use hardware capabilities whenever possible.\n- Go as low level as possible to optimize computations.\n- Write high level code to improve readability.\n\nBut how to go as high level as possible and optimize the code at the same time?\nTo be honest, I didn't even think about that at first...\nI started to write all the code in C, so that I could get a working prototype.\nThen I introduced some high level C++ to improve the code readability.\nAs I was doing that, I noticed the compiled program was getting smaller and smaller.\nSo, without any massive effort, I managed to write high level readable code that was also quite optimized.\nAt some point, the program was mainly written in C and was using 978 bytes of flash.\nRewriting the same program in C++ decreased the program size to 918 bytes.\nI didn't try to find the reason why that is, but my conclusion was that gcc is awesome!\n\n## What's Next?\n\nIt would take a long time to describe everything that's going on, so I'll stop here for now and cover more things in part 2.\nThe next part will be about getting the code to compile and upload to the Arduino board, without the Arduino library.\n",
            "url": "https://news.exadrums.com/article/new-arduino-nano-every-board-part1",
            "title": "New Arduino Nano Every Trigger Board - Part 1",
            "summary": "This project has been in the works for about a year.\nI often get questions about MIDI support, so I spent some time developing a new exadrums board that supports MIDI.\nBefore we start, please note that this post will be split into several parts.\nThe board is capable of handling 8 triggers.\nIt can send MIDI notes over USB, or directly to a serial device such as a Raspberry Pi.\nThere is no on-board Analog to Digital Converter (ADC). Instead, there are two 15-position Arduino Nano-compatible female headers.\nAny microcontroller that is pin-compatible with the Arduino Nano will fit.\nFor the rest of this post, I'll assume that the microcontroller is an Arduino Nano Every.\nBut before we dive into the details, check out that board!\n\n\nBoard alone (left), and board with Arduino mounted on (right).\nI went for a blue PCB so that it would match the Arduino's color.",
            "date_modified": "2022-05-01T12:41:05.000Z",
            "date_published": "2022-05-01T12:41:05.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/new-arduino-nano-every-board-part2",
            "content_html": "\nThis is a series of posts. If you haven't read the previous part here's a link to it: [New Arduino Nano Every Trigger Board - Part 1](/article/new-arduino-nano-every-board-part1).\nIn this part, I'm going to describe how to compile C++ code and upload it to the Arduino Nano Every without using the Arduino library.\n\nBut why would one want to do that, you may ask?\nThe answer is simple: the Arduino library does a lot of things that may impact performance.\nFor instance, some interrupts are being fired frequently, and slow things down.\n\nLet's be honest, we're not going to reinvent the wheel, most of what we are going to do here is to use the Arduino IDE's compiler and tools.\nSay we install the Arduino IDE (version 1.8.9) and compile a program.\nHere's what we're going to see:\n\n![image](/images/new-arduino-nano-every-board/arduino-ide.png)\n\nThe interesting part is the console, where all the compilation-related messages are shown.\nWe see that the IDE uses avr-gcc version 7.3.0, along with a few other tools.\nLet's see what we can do with that.\n\n<!--more-->\n\nFirst of all, we can see *where* all these tools are located.\nA little digging reveals that an environment variable named *AVR_TOOLS_DIR* contains the tools folder location.\nThus, we can type the following: `$AVR_TOOLS_DIR/avr-gcc/7.3.0-atmel3.6.1-arduino5/bin/avr-gcc --version` and execute the command in a terminal.\nThis will print the avr-gcc version.\n\n## Makefile for the Arduino Nano Every\n\nThis is not a tutorial about makefiles, if you want an in-depth tutorial about makefiles, please read the official [GNU Make Manual](https://www.gnu.org/software/make/manual/).\nWith that out of the way, let's write a makefile.\n\n### Variables\n\nFirst of all, we need to define some variables.\nHaving the avr-gcc bin directory as variable seems like a good idea, so we define the following: `BIN_DIR?=${AVR_TOOLS_DIR}/avr-gcc/7.3.0-atmel3.6.1-arduino5/bin`.\nYour bin directory may differ, so be sure to check its correct location.\nThat's the only variable we'll need for the compiling process.\n\nThere's one more thing that we need in order to upload the compiled program to the Arduino, though.\nThis thing is avrdude.\nIt's a little bit trickier, as we need the avrdude executable and a configuration file.\nSo here are our variables:\n\n```makefile\nAVRDUDE_DIR?=${AVR_TOOLS_DIR}/avrdude/6.3.0-arduino17/\nAVRDUDE?=${AVRDUDE_DIR}/bin/avrdude\nCONFDIR?=${AVRDUDE_DIR}/etc/avrdude.conf\n```\n\nAgain, be sure to check the the executable path.\nIf you want to provide your own configuration file, you can use the following (sorry, it isn't a short snippet...):\n\n```ini\n\n#------------------------------------------------------------\n# AVR8X family common values\n#------------------------------------------------------------\n\npart\n    id        = \".avr8x\";\n    desc    = \"AVR8X family common values\";\n    has_updi    = yes;\n    nvm_base    = 0x1000;\n    ocd_base    = 0x0F80;\n\n    memory \"signature\"\n        size        = 3;\n        offset        = 0x1100;\n    ;\n\n    memory \"prodsig\"\n        size        = 0x3D;\n        offset        = 0x1103;\n        page_size    = 0x3D;\n        readsize    = 0x3D;\n    ;\n\n    memory \"fuses\"\n        size        = 9;\n        offset        = 0x1280;\n    ;\n\n    memory \"fuse0\"\n        size        = 1;\n        offset        = 0x1280;\n    ;\n\n    memory \"fuse1\"\n        size        = 1;\n        offset        = 0x1281;\n    ;\n\n    memory \"fuse2\"\n        size        = 1;\n        offset        = 0x1282;\n    ;\n\n    memory \"fuse4\"\n        size        = 1;\n        offset        = 0x1284;\n    ;\n\n    memory \"fuse5\"\n        size        = 1;\n        offset        = 0x1285;\n    ;\n\n    memory \"fuse6\"\n        size        = 1;\n        offset        = 0x1286;\n    ;\n\n    memory \"fuse7\"\n        size        = 1;\n        offset        = 0x1287;\n    ;\n\n    memory \"fuse8\"\n        size        = 1;\n        offset        = 0x1288;\n    ;\n\n    memory \"lock\"\n        size        = 1;\n        offset        = 0x128a;\n    ;\n\n    memory \"data\"\n        # SRAM, only used to supply the offset\n        offset        = 0x1000000;\n    ;\n;\n\n\n#------------------------------------------------------------\n# AVR8X mega family common values\n#------------------------------------------------------------\n\npart parent    \".avr8x\"\n    id            = \".avr8x_mega\";\n    desc        = \"AVR8X mega family common values\";\n    family_id    = \"megaAVR\";\n\n    memory \"usersig\"\n        size        = 0x40;\n        offset        = 0x1300;\n        page_size    = 0x40;\n        readsize    = 0x100;\n    ;\n;\n\n#------------------------------------------------------------\n# ATmega4809\n#------------------------------------------------------------\n\npart parent    \".avr8x_mega\"\n    id        = \"m4809\";\n    desc      = \"ATmega4809\";\n    signature = 0x1E 0x96 0x51;\n\n    memory \"flash\"\n        size      = 0xC000;\n        offset    = 0x4000;\n        page_size = 0x80;\n        readsize  = 0x100;\n    ;\n\n    memory \"eeprom\"\n        size      = 0x100;\n        offset    = 0x1400;\n        page_size = 0x40;\n        readsize  = 0x100;\n    ;\n;\n\nprogrammer\n  id    = \"jtag2updi\";\n  desc  = \"JTAGv2 to UPDI bridge\";\n  type  = \"jtagmkii_pdi\";\n  connection_type = serial;\n  baudrate = 115200;\n;\n\n```\n\nAnd the last variable that we need is the Arduino serial port: `PORT?=/dev/ttyACM0`.\nYou can find that information in the Arduino IDE (in the *tools* menu).\n\n### Rules\n\nNow that we have defined all the variables that we need, we have to create some rules to compile and upload our code to the Arduino.\nTo that end, we are going to have three rules: `all`, to compile the code, `upload`, to upload the binary to the board, and `clean` to remove all the build files.\n\nLet's start with the `all` rule:\n\n```makefile\nall:\n    ${BIN_DIR}/avr-g++ -c -g -Os -w -std=c++17 -fpermissive -fno-exceptions -ffunction-sections -fdata-sections -fno-threadsafe-statics -Wno-error=narrowing -MMD -flto -mmcu=atmega4809 -DF_CPU=16000000L -DARDUINO=10809 -DARDUINO_AVR_NANO_EVERY main.cpp -o main.o\n    ${BIN_DIR}/avr-g++ -w -Os -g -flto -fuse-linker-plugin -Wl,--gc-sections -Wl,--section-start=.text=0x0 -mmcu=atmega4809 -o main.elf main.o\n    ${BIN_DIR}/avr-objcopy -O binary -R .eeprom main.elf main.bin\n    ${BIN_DIR}/avr-objcopy -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 main.elf main.eep\n    ${BIN_DIR}/avr-objcopy -O ihex -R .eeprom main.elf main.hex\n    ${BIN_DIR}/avr-size -C main.elf\n```\n\nThis mostly comes from the Arduino IDE's console output window.\nI've made only very small modifications.\nThe `upload` rule is also taken from the Arduino IDE:\n\n```makefile\nupload:\n    python3 ./reset.py ${PORT}\n    ${AVRDUDE} -C${CONFDIR} -v -patmega4809 -cjtag2updi -P${PORT} -b115200 -e -D -Uflash:w:main.hex:i -Ufuse2:w:0x01:m -Ufuse5:w:0xC9:m -Ufuse8:w:0x00:m\n```\n\nThere is one subtle thing here.\nIf we check the Arduino IDE's console output, we can read the following message: `Forcing reset using 1200 bps open/close on port /dev/ttyACM0`.\nThis means that we need to reset the Arduino before avrdude starts uploading the program.\nI found that the more reliable way to do that is to use a little python3 script:\n\n```python\n#!/usr/bin/python\n\nimport sys\nimport serial\n\ncom = serial.Serial(sys.argv[1], 1200)\ncom.dtr=False\ncom.close()\n```\n\nFinally, we need a `clean` rule that removes all the compiled files.\nThis is a pretty easy rule to write, so I'll just throw the whole makefile there:\n\n```makefile\nBIN_DIR?=${AVR_TOOLS_DIR}/avr-gcc/7.3.0-atmel3.6.1-arduino5/bin\nAVRDUDE_DIR?=${AVR_TOOLS_DIR}/avrdude/6.3.0-arduino17/\nAVRDUDE?=${AVRDUDE_DIR}/bin/avrdude\nCONFDIR?=${AVRDUDE_DIR}/etc/avrdude.conf\n\nPORT?=/dev/ttyACM0\n\nall:\n    ${BIN_DIR}/avr-g++ -c -g -Os -w -std=c++17 -fpermissive -fno-exceptions -ffunction-sections -fdata-sections -fno-threadsafe-statics -Wno-error=narrowing -MMD -flto -mmcu=atmega4809 -DF_CPU=16000000L -DARDUINO=10809 -DARDUINO_AVR_NANO_EVERY main.cpp -o main.o\n    ${BIN_DIR}/avr-g++ -w -Os -g -flto -fuse-linker-plugin -Wl,--gc-sections -Wl,--section-start=.text=0x0 -mmcu=atmega4809 -o main.elf main.o\n    ${BIN_DIR}/avr-objcopy -O binary -R .eeprom main.elf main.bin\n    ${BIN_DIR}/avr-objcopy -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 main.elf main.eep\n    ${BIN_DIR}/avr-objcopy -O ihex -R .eeprom main.elf main.hex\n    ${BIN_DIR}/avr-size -C main.elf\n\n\nupload:\n    python3 ./reset.py ${PORT}\n    ${AVRDUDE} -C${CONFDIR} -v -patmega4809 -cjtag2updi -P${PORT} -b115200 -e -D -Uflash:w:main.hex:i -Ufuse2:w:0x01:m -Ufuse5:w:0xC9:m -Ufuse8:w:0x00:m\n\n\nclean:\n    rm -f main.bin main.d main.eep main.elf main.hex main.o\n```\n\nThere we are, all that's left is to put this in a `Makefile`file.\nNow we can type `make` to compile the code and `make upload` to upload it to the board.\n\n## Example: Blink the On-board LED\n\nWe are going to go through a very simple example: the LED blink example.\n\n### Arduino Version\n\nHere's the Arduino code for the LED blink example:\n\n```cpp\nconst int ledPin = 13;\n\nvoid setup() {\n  pinMode(ledPin, OUTPUT);\n}\n\nvoid loop() {\n  digitalWrite(ledPin, HIGH);   // set the LED on\n  delay(1000);                  // wait for a second\n  digitalWrite(ledPin, LOW);    // set the LED off\n  delay(1000);                  // wait for a second\n}\n```\n\nUsing the Arduino IDE to compile this code, we get the following message:\n\n```text\nSketch uses 1118 bytes (2%) of program storage space. Maximum is 49152 bytes.\nGlobal variables use 22 bytes (0%) of dynamic memory, leaving 6122 bytes for local variables. Maximum is 6144 bytes.\n```\n\nSo, in order to make a LED blink every second, we need 1118 bytes of program space, and 22 bytes of RAM.\nTo me, that sounds like a lot!\n\n### C Version\n\nNow let's go low-level and see what we can do without using the Arduino library.\nSince we're using a C++ compiler, it's not really C code, but it looks like it is:\n\n```cpp\n#include <avr/io.h>\n#include <util/delay.h>\n\nint main()\n{\n    _PROTECTED_WRITE(CLKCTRL_MCLKCTRLB, 0x00); // Disable prescaler\n\n    PORTE.DIRSET |= PIN2_bm;\n\n    for(;;)\n    {\n        _delay_ms(1000);\n        PORTE.OUTTGL |= PIN2_bm;\n    }\n\n    return 0;\n}\n```\n\nThe first line of the main function is used to disable the prescaler, which ensures that the CPU runs at the wanted 16MHz frequency.\nIf you check out the Arduino Nano Every connector pinouts, you'll see that the on-board LED is connected to `D13`.\nThis pin is also labeled `SCK` and `PE2`.\nThe latter tells us that this particular pin is wired to port E, pin 2.\nAnd that's all we need for our LED blink example.\nFirst we use the `DIRSET` register of port E to set the pin 2 bit, which will set pin 2 as an output.\nThen, in the main for loop, we write the pin 2 bit into the `OUTTGL` register, which toggles the state of pin 2.\nIn between each toggling, we use the `_delay_ms` function, which allows us to wait for a given time.\n\nThe ports registers and pins definitions are provided by the `avr/io.h` header which contains everything we need.\nBecause we passed the `-mmcu=atmega4809` flag to avr-gcc in our makefile, it knows that we are using an ATMega4809.\nThe `_delay_ms` function comes from `util/delay.h`, it needs to know the CPU clock frequency, which why we passed to avr-gcc using `-DF_CPU=16000000L`.\n\nThis program does the same thing as the previous one, except it uses a lot less memory and needs no RAM:\n\n```text\nAVR Memory Usage\n----------------\nDevice: Unknown\n\nProgram:     238 bytes\n(.text + .data + .bootloader)\n\nData:          0 bytes\n(.data + .bss + .noinit)\n```\n\n### C++ Version\n\nOkay, so I'm not a big fan of C, and I wonder if we could make this code more readable.\nI would like to be able to write something like `led.Toggle()` instead of `PORTE.OUTTGL |= PIN2_bm`.\n\nIn order to be as generic as possible, we are going to define a class that allows pin manipulation.\nOne more thing: I really don't like pointers, so we are going to try to avoid them at all cost.\n\nFirst of all, we need to know how `PORTE` is defined.\nIts definition lies in the `avr/include/avr/iom4809.h` file: `#define PORTE                (*(PORT_t *) 0x0480) /* I/O Ports */`, where `PORT_t` is a big struct with a bunch of `register_t` in it.\nFort instance, `OUTTGL` and `DIRSET` are in that struct.\nAnd here's where it gets kind of ugly: `typedef volatile uint8_t register8_t;`.\nEvery `register8_t` is declared as volatile, which makes sense because our LED blink wouldn't work otherwise (the compiler would optimize away the `PORTE.OUTTGL |= PIN2_bm` line).\n\nSo, the first thing that we need, is the address of `PORTE`.\nBecause of that `volatile` keyword, we can't use `constexpr` nor `static_cast`, so we are going to define it as: `static const auto PORTE_ADDR = reinterpret_cast<uint16_t>(&PORTE);`.\nNote that this is a 16-bit address\n\nNow we define a pin as a port and a pin number.\nIn our case: port E (its address) and pin 2 (its bit mask).\nThese two things are known at compile time, so we can use them as template parameters.\nHence, we are going to define a `Pin` class that take these two parameters as template parameters:\n\n```cpp\nnamespace DigitalIO\n{\n\n    static const auto PORTE_ADDR = reinterpret_cast<uint16_t>(&PORTE);\n\n    template <uint16_t portAddr, uint8_t mask>\n    class Pin\n    {\n    public:\n        Pin() = delete;\n        ~Pin() = delete;\n\n        static constexpr void ConfigureAsInput()\n        {\n            port().DIRSET &= ~mask;\n        }\n\n        static constexpr void ConfigureAsOutput()\n        {\n            port().DIRSET |= mask;\n        }\n\n        static constexpr void Toggle()\n        {\n            port().OUTTGL |= mask;\n        }\n\n        static constexpr void SetHigh()\n        {\n            port().OUTSET |= mask;\n        }\n\n        static constexpr void SetLow()\n        {\n            port().OUTCLR |= mask;\n        }\n\n        static constexpr auto& port()\n        {\n            return *reinterpret_cast<PORT_t*>(portAddr);\n        }\n        \n    private:\n\n    };\n    \n} // namespace IO\n```\n\nWe need to cast the port address back to a `PORT_t` struct, which is the role of the `port()` function.\nThe rest of the code is pretty straightforward, we encapsulate our C code into `static` methods.\n\nHere's how to use this code:\n\n```cpp\n#include \"DigitalIO.h\"\n\n#include <avr/io.h>\n#include <util/delay.h>\n\n#include <stdint.h>\n\nusing Led = DigitalIO::Pin<DigitalIO::PORTE_ADDR, PIN2_bm>;\n\nint main()\n{\n    _PROTECTED_WRITE(CLKCTRL_MCLKCTRLB, 0x00); // Disable prescaler\n\n    Led::ConfigureAsOutput();\n\n    for(;;)\n    {\n        _delay_ms(1000);\n        Led::Toggle();\n    }\n\n    return 0;\n}\n```\n\nIt looks almost the same as the previous code, except that it's a bit more readable.\n\nBut we did add quite a bit of boilerplate code in our `DigitalIO.h` file, is that a good idea?\nI believe it is. Right now, we don't see how this can be very useful because our program is small and basic.\nWith a bigger code base, I think it would be way easier to understand our code with a well-structured C++ program.\n\nBut wait a minute, isn't all that code going to add more bytes to our program?\nLet's check that, shall we?\n\n```text\nAVR Memory Usage\n----------------\nDevice: Unknown\n\nProgram:     238 bytes\n(.text + .data + .bootloader)\n\nData:          0 bytes\n(.data + .bss + .noinit)\n```\n\nIt doesn't. In fact the assembly code is exactly the same as the previous one.\nWhy is that? Because gcc is awesome, of course!\nSo, we can write C++ code and get the same assembly code as a C program, that's what we call *zero cost abstraction*.\n\n## What's Next?\n\nOkay, so we've seen how to program an Arduino Nano Every without using the Arduino library.\nThrough a very simple example, we've also seen that C and C++ code lead to the same assembly code.\n\nIn the next part, we will focus on MIDI and see how we can turn our Arduino Nano Every into a MIDI device.\n",
            "url": "https://news.exadrums.com/article/new-arduino-nano-every-board-part2",
            "title": "New Arduino Nano Every Trigger Board - Part 2",
            "summary": "This is a series of posts. If you haven't read the previous part here's a link to it: New Arduino Nano Every Trigger Board - Part 1.\nIn this part, I'm going to describe how to compile C++ code and upload it to the Arduino Nano Every without using the Arduino library.\nBut why would one want to do that, you may ask?\nThe answer is simple: the Arduino library does a lot of things that may impact performance.\nFor instance, some interrupts are being fired frequently, and slow things down.\nLet's be honest, we're not going to reinvent the wheel, most of what we are going to do here is to use the Arduino IDE's compiler and tools.\nSay we install the Arduino IDE (version 1.8.9) and compile a program.\nHere's what we're going to see:\n\nThe interesting part is the console, where all the compilation-related messages are shown.\nWe see that the IDE uses avr-gcc version 7.3.0, along with a few other tools.\nLet's see what we can do with that.",
            "date_modified": "2022-05-08T15:42:25.000Z",
            "date_published": "2022-05-08T15:42:25.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/new-spi-sensors-config",
            "content_html": "\nExadrums 0.7.0 is currently under development. The biggest feature of this release is the addition of configurable SPI (Serial Peripheral Interface) devices.\nThis features aims to provide a way to add as many SPI devices as you want.\nCurrently supported devices are of the MCP3XXX family, including MCP3008, MCP3204, and MCP3208, but there's a good chance more chips will be added before and after the release of this new version.\n\nThis means that it'll become possible to add more inputs to the trigger input board, by adding more analog to digital converters.\n\n![image](/images/new-spi-sensors-config/spidev-config.png)\n\n<!--more-->\n\n## How SPI Devices Work\n\nAn SPI analog to digital converter takes in analog data, digitizes it, and sends it to a Raspberry Pi using the SPI bus.\nSPI communication offers many advantages, and one of them is that it's quite easy to communicate with several devices.\nThe first eXaDrums input board uses a single MCP3008 chip, which limits the number of inputs to 8.\nAdding another MCP3008 would increase that number to 16, and if you want even more inputs, you could add a third one.\n\nThe Raspberry Pi offers at least one SPI interface that has two `Chip Select` inputs (also called *Chip Enable*).\nSo, with a single SPI bus, `SPI0`, the Raspberry Pi can communicate with two devices, by changing the states of the chip selects pins `CE0` and `CE1`.\n\nBut that's not it. Recent Raspberry Pis have another SPI *bus*: `SPI1`. And it can handle up to three devices via its three chip select inputs `CE0`, `CE1`, and `CE2`.\nSo, in theory it's possible to have up to 5 SPI Analog to Digital converters. Imagine 5 MCP3008, that would mean up to 40 inputs!\nNote that the Raspberry Pi 4 has even more SPI buses, so that should be more than enough, even for a big drum kit with a lot of triggers.\n\nIt's important to note that SPI devices are grouped by bus and chip select, and this is exactly how the SPI configuration works in exadrums.\n\n## How to Configure SPI Devices\n\nOnly supported devices are allowed in the SPI configuration dialog. They are currently limited to MCP3008, MCP3204, and MCP3208.\nEach device must be associated to a bus and a chip select.\nAnd that's basically it.\n\nHere is an example.\nYou make a trigger input board that needs to handle up to 16 analog inputs.\nThe MCP3008 is a good choice, so you decide to use two of them.\nYou can either have one of them use the `SPI0`, and the other the `SPI1`, or you can have them both use `SPI1` and choose to use two different chip selects, i.e. `CE0` and `CE1`.\nSo your configuration is:\n|  Name   | Bus | CS |\n|---------|-----|----|\n| MCP3008 |  0  |  0 |\n| MCP3008 |  0  |  1 |\n\nAnd this is exactly how you can configure your SPI devices in exadrums (see screenshot above).\nBy doing that, you'll be able to create up to 16 triggers, numbered 0 to 15, and everything will work out of the box.\n",
            "url": "https://news.exadrums.com/article/new-spi-sensors-config",
            "title": "New SPI Sensors Configurator ⇒ More Trigger Inputs",
            "summary": "Exadrums 0.7.0 is currently under development. The biggest feature of this release is the addition of configurable SPI (Serial Peripheral Interface) devices.\nThis features aims to provide a way to add as many SPI devices as you want.\nCurrently supported devices are of the MCP3XXX family, including MCP3008, MCP3204, and MCP3208, but there's a good chance more chips will be added before and after the release of this new version.\nThis means that it'll become possible to add more inputs to the trigger input board, by adding more analog to digital converters.\n",
            "date_modified": "2021-12-11T13:31:28.000Z",
            "date_published": "2021-12-11T13:31:28.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "content_html": "\nRemember this article about [exadrums becoming an official Debian package](article/debian-bullseye)?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS *bullseye* a few days ago, and as you may have guessed, it includes exadrums packages:\n\n![image](/images/raspberry-pi-os-bullseye/screenshot.png)\n\nNow, you simply have to type `sudo apt install exadrums` into a terminal to install exadrums on your Raspberry Pi.\n\n<!--more-->\n\nIt took some time to get to that point, but you get exadrums 0.6.0, which fairly recent, and works on my Roland TD-4KP drum set.\nIf you'd like to try exadrums with your TD-4KP drum set, it's quite easy.\nFirst of all, you'll need to install *zip*, as it's not installed by default: `sudo apt install zip`.\nThen, you can go to the following page: https://github.com/SpintroniK/exadrums-data/tree/TD-4KP and follow the instructions.\n\nObviously, the project is still under development and future versions will support more inputs, and have a lot of improvements.\nThe official documentation is far from being complete, but I'll make sure to add guidelines to help install the latest version of exadrums on a Raspberry Pi. I will make sure the future versions work on the current version of Raspberry Pi OS *bullseye*. Stay tuned, new versions are coming!\n",
            "url": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "title": "Raspberry Pi OS - Bullseye",
            "summary": "Remember this article about exadrums becoming an official Debian package?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS bullseye a few days ago, and as you may have guessed, it includes exadrums packages:\n\nNow, you simply have to type sudo apt install exadrums into a terminal to install exadrums on your Raspberry Pi.",
            "date_modified": "2021-11-12T18:07:46.000Z",
            "date_published": "2021-11-12T18:07:46.000Z"
        },
        {
            "id": "https://news.exadrums.com/article/the-future-of-exadrums",
            "content_html": "\nThe future of exadrums is probably different than what you may think.\n\nSo far, exadrums is a two-part software, there's a library, libexadrums, and another component: the user interface. The whole drum module is in the library, and exposes a C++ API. That means libexadrums can be used with other languages, such as Python, Javascript, etc.\n\n<!--more-->\n\nA C++ user interface has its advantages, but exadrums could benefit from other languages. For instance,  a more \"connected\" experience would be easier to implement in Python or Javascript.\n\nAnd that's how I see the future of exadrums: a Connected Open Source Drum Module. Some things are already in the works, but others will take some time. However, I'll do my best to publish news more frequently, to keep you informed about the project.\n\nAbout that, the project website [exadrums.com](https://exadrums.com) will be online pretty soon! Hope you'll like it.\n",
            "url": "https://news.exadrums.com/article/the-future-of-exadrums",
            "title": "The Future of exadrums",
            "summary": "The future of exadrums is probably different than what you may think.\nSo far, exadrums is a two-part software, there's a library, libexadrums, and another component: the user interface. The whole drum module is in the library, and exposes a C++ API. That means libexadrums can be used with other languages, such as Python, Javascript, etc.",
            "date_modified": "2021-08-25T14:48:20.000Z",
            "date_published": "2021-08-25T14:48:20.000Z"
        }
    ]
}