{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/latest.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "content_html": "\nRemember this article about [exadrums becoming an official Debian package](article/debian-bullseye)?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS *bullseye* a few days ago, and as you may have guessed, it includes exadrums packages:\n\n![image](/images/raspberry-pi-os-bullseye/screenshot.png)\n\nNow, you simply have to type `sudo apt install exadrums` into a terminal to install exadrums on your Raspberry Pi.\n\n<!--more-->\n\nIt took some time to get to that point, but you get exadrums 0.6.0, which fairly recent, and works on my Roland TD-4KP drum set.\nIf you'd like to try exadrums with your TD-4KP drum set, it's quite easy.\nFirst of all, you'll need to install *zip*, as it's not installed by default: `sudo apt install zip`.\nThen, you can go to the following page: https://github.com/SpintroniK/exadrums-data/tree/TD-4KP and follow the instructions.\n\nObviously, the project is still under development and future versions will support more inputs, and have a lot of improvements.\nThe official documentation is far from being complete, but I'll make sure to add guidelines to help install the latest version of exadrums on a Raspberry Pi. I will make sure the future versions work on the current version of Raspberry Pi OS *bullseye*. Stay tuned, new versions are coming!\n",
            "url": "https://news.exadrums.com/article/raspberry-pi-os-bullseye",
            "title": "Raspberry Pi OS - Bullseye",
            "summary": "Remember this article about exadrums becoming an official Debian package?\nIt's now time to play (exa)drums on your Raspberry Pi.\nThe Raspberry Pi Foundation released the latest Raspberry Pi OS bullseye a few days ago, and as you may have guessed, it includes exadrums packages:\n\nNow, you simply have to type sudo apt install exadrums into a terminal to install exadrums on your Raspberry Pi.",
            "date_modified": "2021-11-12T18:07:46.000Z",
            "date_published": "2021-11-12T18:07:46.000Z"
        }
    ]
}