{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/latest.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/new-arduino-nano-every-board-part5",
            "content_html": "\nThis is a series of posts. If you haven't read the previous part here's a link to it: [New Arduino Nano Every Trigger Board - Part 4](/article/new-arduino-nano-every-board-part4).\n\nAs mentioned in the previous parts, especially the first one, the eXaDrums TB08-SE board can be used together with an Arduino Nano Every and the eXaDrumino Nano Every code to make a MIDI drum module. Here's a picture of the board.\n\n![image](/images/new-arduino-nano-every-board/board.png)\n\nI've been able to test it with my Roland TD17 and it works very well.\nIn particular, it is very impressive to see how much a tiny Arduino Nano Every can do.\nThanks to MIDI, the sound quality is spectacular, and we get multilayer sounds, round-robin, etc. for free by using a VST that handles those things.\nFor my tests, I used [hydrogen](https://hydrogen-music.org/) as a VST. It may not be the best, but it felt like playing with high quality material.\n\n<!--more-->\n\n## Context and Description\n\nThis project is part of the eXaDrums project.\nIt features a new board that allows to connect 8 drum pads to an Arduino Nano Every that, in turns, sends MIDI notes over USB.\nThe board hardware and software are both compatible with eXaDrums, but it can also be used as a standalone device.\n\nThe project name is eXadrumino Nano Every. It is a high performance firmware that allows to read eight analog inputs very fast and send MIDI notes over USB, or via the on-board USART. Using eXaDrums or a PC loaded with a VST, it allows to play drums with a very low latency.\nThe board itself is called *eXaDrums TB08-SE*, and it is compatible with other microcontrollers than the Arduino Nano Every.\n\nHere's a brief reminder of the specs I gave in the first part of this series of articles:\n\n- Works on PC and Raspberry Pi.\n- Up to 7 single-zone pads + 1 hi-hat controller.\n- Compatible with Roland TD-9, TD-11, TD-15, TD-17, TD-25, and TD-27-based edrum kits (DB25 connector).\n- Sample rate greater than 70ksps (kilo samples per second).\n- Nearly 9000 samples per second and per channel (8928 in average).\n- Configurable trigger parameters: threshold, scan time and mask time (1ms step).\n- Configurable MIDI channel and notes.\n\nThe last two are still under development.\n\n## How to Get the Board?\n\nI designed a board and got 5 prototypes PCBs.\nHowever, that board requires some refinements. I would like to make some changes before I share the whole PCB so that it is as good as it can be.\nMeanwhile, you can easily replicate the schematics, as it is a quite simple circuit.\nEvery piezo is wired to a single operational amplifier that acts as a simple amplifier that adds a bias voltage to the signal.\nHere's how it looks:\n\n![Circuit](/images/new-arduino-nano-every-board/Piezo-circuit.png)\n\nThe `Vcc` voltage is taken from the Arduino's 5V `power out` (pin number 12).\nAt the `Vbias` pin, the voltage is 1.65V.\nIt is obtained by using a voltage divider made of two 10k resistors that are wired to the 3.3V `power out` pin of the Arduino (pin number 2).\n\nThe hi-hat controller input is a little different, and simpler.\nIt consists of a single 4.7k resistor wired to the 3.3V pin of the Arduino on one side, and the hi-hat controller as well as the `+` input of voltage follower. It is the same divider for all operational amplifiers.\n\nAnd that's it, you know everything. There are 4 dual operational amplifiers on the board, which makes a total of 8 inputs.\nI got my prototypes from JLCPCB, using their SMT sevice, which means that I received assembled boards, that is, all the components were already soldered, except for the Raspberry Pi GPIO header socket.\nIf you'd like to get you own board, I do recommend JLCPCB, the PCBs are good quality and affordable, the only downside is the shipping cost.\nOr, if you're patient, you can wait until I'm done with improving the board's layout, it shouldn't take too long.\nAgain, I just want to make the best board possible, which will require a few changes.\n\n## Where is the Code?\n\nThe code is freely available at [GitHub](https://github.com/SpintroniK/exadrumino-Nano-Every).\nYou'll find more details as well as instructions that will help you flash the code to your Arduino.\nNote that the code is still a work in progress, some features are not their yet.\nThe most important missing features are those that allow to change trigger and MIDI parameters via the USART, and save those parameters to the on-board EEPROM.\n\n## Previous and Next Parts\n\nSo far there has been 4 parts published in this series of articles. This is the fifth one.\nHere's a reminder of the previous parts and what they talk about:\n\n- [Part 1](/article/new-arduino-nano-every-board-part1): New board specs, and how it works.\n- [Part 2](/article/new-arduino-nano-every-board-part2): Makefile and the way C++ has been used to write the firmware.\n- [Part 3](/article/new-arduino-nano-every-board-part3): Sending serial MIDI notes over USB.\n- [Part 4](/article/new-arduino-nano-every-board-part4): How to use the ADC to make an oscilloscope and read triggers voltages.\n\nThere will be at least two more parts which will deal with the following topics:\n\n- Part 6: How to get an efficient real-time counter.\n- Part 7: How to filter the piezo output signal very fast to make a drum trigger.\n- Part 8: How to read and write values to the on-board EEPROM.\n- Maybe more...\n\nSee you next time!\n",
            "url": "https://news.exadrums.com/article/new-arduino-nano-every-board-part5",
            "title": "New Arduino Nano Every Trigger Board - Part 5",
            "summary": "This is a series of posts. If you haven't read the previous part here's a link to it: New Arduino Nano Every Trigger Board - Part 4.\nAs mentioned in the previous parts, especially the first one, the eXaDrums TB08-SE board can be used together with an Arduino Nano Every and the eXaDrumino Nano Every code to make a MIDI drum module. Here's a picture of the board.\n\nI've been able to test it with my Roland TD17 and it works very well.\nIn particular, it is very impressive to see how much a tiny Arduino Nano Every can do.\nThanks to MIDI, the sound quality is spectacular, and we get multilayer sounds, round-robin, etc. for free by using a VST that handles those things.\nFor my tests, I used hydrogen as a VST. It may not be the best, but it felt like playing with high quality material.",
            "date_modified": "2022-06-15T18:25:57.000Z",
            "date_published": "2022-06-15T18:25:57.000Z"
        }
    ]
}