{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/latest.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "content_html": "\nOver the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\n\nMoreover, exadrums had to be a *modern* and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.\n\n<!--more-->\n\n## How to Make it Work as Expected?\n\nAbout three years ago, I wrote a short article that describes how and why I defined the software and hardware requirements, but also how I managed to make everything work as expected. I'll go into a bit more details below, but you can skip that part if you're in a hurry, and go straight to the article.\n\n## Making a Modern Drum Module\n\nMaking a modern drum module means breaking the rules. Nearly a hundred percent of the existing drum modules use a microcontroller to leverage their real-time properties. However, that means that the amount of memory is often limited, and the user interface is rudimentary (buttons, sliders, etc.), and can't evolve without modifying the hardware.\n\nBy choosing the Raspberry Pi, I made it possible to have a modern user interface, using a touchscreen, but I lost all the real-time goodness that microcontrollers have to offer.\nFortunately, there was a solution to reduce the latency with a Raspberry Pi.\nUnsurprisingly, getting more performance means going low-level, but also getting a good soundcard.\nThe soundcard latency represents a third of the total latency.\nThe software adds another third, and the last third is the trigger scan time.\n\n## Making a Trigger Input Board\n\nMaking a trigger input board, is not overly complicated. But there are still two big challenges:\n\n- Make sure all the components fit on the board.\n- Find a way to make the board compatible with all the drum pads out there.\n\nThe first challenge is not too hard, thanks to SMD components. Especially for a 8-input board. That'll be a bit more difficult with 16 inputs...\nAs for making the board compatible with all the drum pads, I decided to connect potentiometers to the piezos, so that their output voltage can be scaled down if necessary. That avoids the biggest problem: clipping!\n\n## How to Make a Modern Drum Module\n\nNow that you've got the context, maybe you'd like to read the article, so here it is.\nIf for some reason your web browser doesn't show the pdf, here's a link to it: <a href=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" target=\"_blank\">How to Make a Modern Drum Module</a>.\n<object data=\"/docs/how-to-make-a-drum-module/HTMADM.pdf\" type=\"application/pdf\" style=\"width: 100%; height: 100vh\"></object>\n",
            "url": "https://news.exadrums.com/article/how-to-make-a-drum-module",
            "title": "How to Make a Modern Drum Module",
            "summary": "Over the past few years, I've worked on improving exadrums to make it as complete as possible.\nHowever, before that, I spent a lot of time making sure the software and hardware would meet some very specific requirements.\nOn the software side, the latency had to be below 10ms, and the sound quality at least as good as our dear old compact discs.\nAnd on the hardware side, the trigger input board had to preserve the piezos' dynamics, and be compatible with most edrums out there.\nAchieving all of this wasn't an easy task, and took about three years, from September 2015 to September 2018.\nMoreover, exadrums had to be a modern and accessible drum module. Which is why it is based on the Raspberry Pi (2+) and uses a 7\" touchscreen. So, September 2018 was the confirmation that all those targets were reached, and it was time to write down how all these things came together.",
            "date_modified": "2021-10-02T06:27:36.000Z",
            "date_published": "2021-10-02T06:27:36.000Z"
        }
    ]
}