{
    "version": "https://jsonfeed.org/version/1",
    "title": "exadrums - news",
    "home_page_url": "https://news.exadrums.com/latest.json",
    "description": "eXaDrums project: latest news.",
    "items": [
        {
            "id": "https://news.exadrums.com/article/new-spi-sensors-config",
            "content_html": "\nExadrums 0.7.0 is currently under development. The biggest feature of this release is the addition of configurable SPI (Serial Peripheral Interface) devices.\nThis features aims to provide a way to add as many SPI devices as you want.\nCurrently supported devices are of the MCP3XXX family, including MCP3008, MCP3204, and MCP3208, but there's a good chance more chips will be added before and after the release of this new version.\n\nThis means that it'll become possible to add more inputs to the trigger input board, by adding more analog to digital converters.\n\n![image](/images/new-spi-sensors-config/spidev-config.png)\n\n<!--more-->\n\n## How SPI Devices Work\n\nAn SPI analog to digital converter takes in analog data, digitizes it, and sends it to a Raspberry Pi using the SPI bus.\nSPI communication offers many advantages, and one of them is that it's quite easy to communicate with several devices.\nThe first eXaDrums input board uses a single MCP3008 chip, which limits the number of inputs to 8.\nAdding another MCP3008 would increase that number to 16, and if you want even more inputs, you could add a third one.\n\nThe Raspberry Pi offers at least one SPI interface that has two `Chip Select` inputs (also called *Chip Enable*).\nSo, with a single SPI bus, `SPI0`, the Raspberry Pi can communicate with two devices, by changing the states of the chip selects pins `CE0` and `CE1`.\n\nBut that's not it. Recent Raspberry Pis have another SPI *bus*: `SPI1`. And it can handle up to three devices via its three chip select inputs `CE0`, `CE1`, and `CE2`.\nSo, in theory it's possible to have up to 5 SPI Analog to Digital converters. Imagine 5 MCP3008, that would mean up to 40 inputs!\nNote that the Raspberry Pi 4 has even more SPI buses, so that should be more than enough, even for a big drum kit with a lot of triggers.\n\nIt's important to note that SPI devices are grouped by bus and chip select, and this is exactly how the SPI configuration works in exadrums.\n\n## How to Configure SPI Devices\n\nOnly supported devices are allowed in the SPI configuration dialog. They are currently limited to MCP3008, MCP3204, and MCP3208.\nEach device must be associated to a bus and a chip select.\nAnd that's basically it.\n\nHere is an example.\nYou make a trigger input board that needs to handle up to 16 analog inputs.\nThe MCP3008 is a good choice, so you decide to use two of them.\nYou can either have one of them use the `SPI0`, and the other the `SPI1`, or you can have them both use `SPI1` and choose to use two different chip selects, i.e. `CE0` and `CE1`.\nSo your configuration is:\n|  Name   | Bus | CS |\n|---------|-----|----|\n| MCP3008 |  0  |  0 |\n| MCP3008 |  0  |  1 |\n\nAnd this is exactly how you can configure your SPI devices in exadrums (see screenshot above).\nBy doing that, you'll be able to create up to 16 triggers, numbered 0 to 15, and everything will work out of the box.\n",
            "url": "https://news.exadrums.com/article/new-spi-sensors-config",
            "title": "New SPI Sensors Configurator ⇒ More Trigger Inputs",
            "summary": "Exadrums 0.7.0 is currently under development. The biggest feature of this release is the addition of configurable SPI (Serial Peripheral Interface) devices.\nThis features aims to provide a way to add as many SPI devices as you want.\nCurrently supported devices are of the MCP3XXX family, including MCP3008, MCP3204, and MCP3208, but there's a good chance more chips will be added before and after the release of this new version.\nThis means that it'll become possible to add more inputs to the trigger input board, by adding more analog to digital converters.\n",
            "date_modified": "2021-12-11T13:31:28.000Z",
            "date_published": "2021-12-11T13:31:28.000Z"
        }
    ]
}